app/controllers/post_controller.rb

SELECT  "users".* FROM "users" WHERE "user_id"."id" = ? AND "user_id"."Login" = ? AND "user_id"."created_at" = ? AND "user_id"."updated_at" = ? LIMIT ?  [["id", 6], ["Login", "sdk"], ["created_at", "2018-12-19T20:31:11.314Z"], ["updated_at", "2018-12-19T20:31:11.314Z"], ["LIMIT", 1]]
INSERT INTO "posts" ("score", "avatar", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["score", "100"], ["avatar", nil], ["created_at", "2018-12-19 01:17:20.569648"], ["updated_at", "2018-12-19 01:17:20.569648"], ["user_id", 3]]
---
  def create
    @userp = User.find_by(Login: session[:current_user_id])
    params[:post][:avatar] = File.open(post_params[:avatar])
    @post = @userp.userparam.posts.build(post_params)
    @post.save

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]
---
  def destroy
    @post = find_post
    if @post.present?
    @post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find_by(id: params[:id])