app/controllers/userparam_controller.rb

  def index
    @userp = Userparam.all
---
SELECT  "userparams".* FROM "userparams" WHERE "userparams"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

  def Find_User
    @userp = User.find_by(Login: user_params[:Login])
    if !@userp.nil?
      session[:current_user_id] = @userp.Login
      render :json => {:Login => @userp.Login, :Password => @userp.password, :score => @userp.userparam.score, :Message => "You're entered"}
    else
     @userp = User.new
     @userp.Login = user_params[:Login]
     @userp.password = user_params[:Password]
     @userp.userparam = Userparam.new(user_params)
     @userp.userparam.score = 0
     session[:current_user_id] = @userp.Login
     @userp.save
---
SELECT  "users".* FROM "users" WHERE "users"."Login" = ? LIMIT ?  [["Login", "sdf"], ["LIMIT", 1]]
INSERT INTO "userparams" ("Login", "Password", "score", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["Login", "sddd"], ["Password", "123123"], ["score", 0], ["created_at", "2018-12-18 21:01:46.980469"], ["updated_at", "2018-12-18 21:01:46.980469"], ["user_id", 5]]
INSERT INTO "users" ("Login", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)